posts/monadicity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-17 Sat 11:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Monadicity for the Curious Programmer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Reed Mullanix" />
</head>
<body>
<div id="content">
<h1 class="title">Monadicity for the Curious Programmer</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org99b8113">1. Introduction</a></li>
<li><a href="#orgf3e263e">2. Algebra</a></li>
<li><a href="#orga237905">3. Monads</a></li>
<li><a href="#org87bbc34">4. A Surprising Equivalence</a></li>
<li><a href="#org0bbc0b3">5. Conclusion</a></li>
<li><a href="#org9d90e28">6. Proofs</a>
<ul>
<li><a href="#org71e593f">6.1. <code>toAlgebra</code> is a T-Algebra</a></li>
<li><a href="#orgc54e86e">6.2. <code>fromAlgebra</code> is a Monoid</a></li>
<li><a href="#org00d16a3">6.3. <code>toAlgebra . fromAlgebra = id</code> and <code>fromAlgebra . toAlgebra = id</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org99b8113" class="outline-2">
<h2 id="org99b8113"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Today, I want to tell an interesting story about algebraic
structures and their evaluators. After we are finished, we will have
learned some non-trivial category theory, and gained a greater
appreciation for some of the basic tools that we take for
granted. However, before we tell the end of the story, we must tell
the beginning.
</p>
</div>
</div>
<div id="outline-container-orgf3e263e" class="outline-2">
<h2 id="orgf3e263e"><span class="section-number-2">2</span> Algebra</h2>
<div class="outline-text-2" id="text-2">
<p>
The story starts, like many good programming stories, with the idea
of an algebraic structure. Most Haskell folks are pretty familiar
with a few of these: <code>Semigroup</code>, <code>Monoid</code>, etc. However, there are
a huge number of increasingly fancy structures that we don't see as
often: Rings, Vector Spaces, Abelian Groups, etc. What unites all of these
things together under the banner of "Algebra". Furthermore, what
even <i>is</i> algebra all about.
</p>

<p>
Here's one perspective: Algebra is about the reduction or evaluation of expressions.
For instance, given some expression language, we could consider
"evaluators" of the expression language:
</p>
<div class="org-src-container">
<pre class="src src-haskell">data Expr a = Op (Expr a) (Expr a) | Lit a

type Evaluator a = Expr a -&gt; a

sumExpr :: Evaluator Int
sumExpr (Op a b) = (sumExpr a) + (sumExpr b)
sumExpr (Lit a) = a

andExpr :: Evaluator Bool
andExpr (Op a b) = (andExpr a) &amp;&amp; (andExpr b)
andExpr (Lit a) = a
</pre>
</div>

<p>
Now, for a teeny bit of sweeping generalization. All that <code>Expr</code>
does here is provide a bunch of <code>a</code> with some sort of structure
binding them together. There's nothing special about it! Therefore,
we can think about "evaluators" for <i>any</i> sort of expression
structure by making it a type parameter to <code>Evaluator</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell">type Evaluator f a = f a -&gt; a

sumExpr :: Evaluator Expr Int
sumExpr (Op a b) = (sumExpr a) + (sumExpr b)
sumExpr (Lit a) = a

sumList :: Evaluator [] Int
sumList = sum
</pre>
</div>

<p>
Now, it is totally reasonable to regard this with suspicion. What do
we achieve by doing this? From a purely programming standpoint, not a
whole lot. However, this is a huge perspective shift. What we've
done here is capture the essence of "reduction of a structure" in a
very simple construct! Furthermore, our <code>Evaluator</code> type is actually
a core idea in Categorical Algebra, where it has another name: an <b>F-Algebra</b>.
To keep things in line with the theory, moving forward I will using
F-Algebra, and refer to the following Haskell type:
</p>
<div class="org-src-container">
<pre class="src src-haskell">type Algebra f a = f a -&gt; a
</pre>
</div>
</div>
</div>

<div id="outline-container-orga237905" class="outline-2">
<h2 id="orga237905"><span class="section-number-2">3</span> Monads</h2>
<div class="outline-text-2" id="text-3">
<p>
Now, for a bit of conflict. For some choices of <code>f</code> in our
F-Algebras, we have <span class="underline">two</span> ways of reducing down a structure!
Particularly, if <code>f</code> is a <code>Monad</code>, we have can either:
</p>
<ol class="org-ol">
<li>Run the <code>Algebra</code> to reduce an <code>f a</code> to an <code>a</code></li>
<li>Use <code>join :: f (f a) -&gt; f a</code> to smoosh two layers of <code>f</code> together</li>
</ol>

<p>
This is quite the pickle! The whole point of this generalization is
to capture the essence of reduction, and now we are presented two
different ways! What a mess.
</p>

<p>
However, like many problems, we can resolve it by adding some laws
that make sure that our <code>Algebra</code> and our <code>Monad</code> instance
"play nicely". Let's say we have some <code>eval :: Algebra f a</code>, as
well as <code>Monad f</code>. Our first law should be pretty unobjectionable:
</p>
<div class="org-src-container">
<pre class="src src-haskell">eval/pure: id = eval . pure
</pre>
</div>
<p>
What this law says is that making an <code>f a</code> via <code>pure</code> and
immediately evaluating it down ought to be the same as doing
nothing. If we test this out with our <code>sumList</code> evaluator before,
this makes a lot of sense:
</p>
<div class="org-src-container">
<pre class="src src-haskell">sumList $ pure n = sumList [n]
		 = n
</pre>
</div>

<p>
Now, for the second law. This one is a bit trickier, so build it up
piece by piece. The original problem at hand was that we could
reduce down an <code>f (f a)</code> to an <code>a</code> in two ways:
</p>
<ol class="org-ol">
<li>We smoosh the two layers together via <code>join</code> to get an <code>f a</code>,
then <code>eval</code> it.</li>
<li>We first <code>eval</code> the inner layer via <code>fmap eval</code> to get an <code>f a</code>,
then <code>eval</code> the outer layer.</li>
</ol>

<p>
Therefore, our law will say that these two things ought to be the same!
</p>
<div class="org-src-container">
<pre class="src src-haskell">eval/join : eval . fmap eval = eval . join
</pre>
</div>

<p>
Now, let's give these extra-fancy F-Algebras a name, or rather, use
the name that mathematicians have given them: <b>T-Algebras</b>. The "T"
here refers to the common practice of denoting a monad with <code>T</code> in
the literature.
</p>
</div>
</div>
<div id="outline-container-org87bbc34" class="outline-2">
<h2 id="org87bbc34"><span class="section-number-2">4</span> A Surprising Equivalence</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that the stage is set and we have met our cast of characters, we
can finally start to tell the <span class="underline">actual</span> story! Let's start with an observation:
We can turn any <code>Monoid</code> into a T-Algebra for lists:
</p>
<div class="org-src-container">
<pre class="src src-haskell">toAlgebra :: Monoid m =&gt; Algebra [] m
toAlgebra xs = foldr (&lt;&gt;) mempty xs
</pre>
</div>

<p>
Those interested in the proofs of these laws can check the <a href="#org9d90e28">Proofs</a> section.
</p>

<p>
Now, time for the crazy part: Given a T-Algebra, we can construct a
lawful Monoid! As Haskell doesn't let us programatically construct
instances, let's just pretend a Monoid is a record for now:
</p>
<div class="org-src-container">
<pre class="src src-haskell">fromAlgebra ::: Algebra [] m -&gt; Monoid m
fromAlgebra alg = Monoid
    { mempty = alg []
    , mappend = \x y -&gt; alg [x, y]
    }
</pre>
</div>
<p>
The Monoid laws fall out of the T-Algebra laws we imposed
earlier. Again, interested readers can check the <a href="#org9d90e28">Proofs</a> section for
the full proofs of this.
</p>

<p>
So in some sense, T-Algebras for lists are the <span class="underline">same</span> as Monoids!
This is no coincidence. In particular, lists form the Free Monoid,
which is what causes this whole series of events to unfurl. In
categorical language, we would say that the Category of T-Algebras
for Lists is <b>equivalent</b> to the Category of Monoids. This does
require us to show that <code>toAlgebra . fromAlgebra = id</code> and
<code>fromAlgebra . toAlgebra = id</code>, but that is relegated to the <a href="#org9d90e28">Proofs</a> section.
</p>

<p>
The even more incredible part is that this isn't just restricted to
Monoids. This works for all "well behaved" algebraic structures you
can dream up! For instance, T-Algebras for free groups are the same
as groups, T-Algebras for free modules are the same as modules, etc.
</p>
</div>
</div>

<div id="outline-container-org0bbc0b3" class="outline-2">
<h2 id="org0bbc0b3"><span class="section-number-2">5</span> Conclusion</h2>
<div class="outline-text-2" id="text-5">
<p>
So what does this actually <i>mean</i>? Personally, it gives me a new
perspective on how to think about algebraic structures. Rather than
being a collection of operations and laws, we can think of them as
providing a way of interpreting particular types of expression
trees, or reducing down particular types of data structures. This
also opens the gate to all sorts of amazing generalization, where we
can view things that don't traditionally look algebraic as algebras!
For instance, this works for the power-set functor <code>Setᵒᵖ → Set</code>, as
well as for certain types of spaces. All in all, I think this is a
gem of Categorical Algebra, and one that ought to be
appreciated. If you would like to learn more, the magic words to
search are "Monadic Functor" and "Monadicity".
</p>
</div>
</div>
<div id="outline-container-org9d90e28" class="outline-2">
<h2 id="org9d90e28"><span class="section-number-2">6</span> Proofs</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org71e593f" class="outline-3">
<h3 id="org71e593f"><span class="section-number-3">6.1</span> <code>toAlgebra</code> is a T-Algebra</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The first one is relatively straightforward:
</p>
<div class="org-src-container">
<pre class="src src-haskell">eval/pure:
toAlgebra (pure m) = toAlgebra [m]         -- By Defn. of pure
		   = foldr (&lt;&gt;) mempty [m] -- By Defn. of toAlgebra
		   = m &lt;&gt; mempty           -- By Defn. of foldr
		   = m                     -- By right identity law for monoids
</pre>
</div>

<p>
However, the next requires a proof by induction:
</p>
<div class="org-src-container">
<pre class="src src-haskell">-- Base Case:
eval/join/nil:
toAlgebra $ fmap toAlgebra [] = toAlgebra []        -- By Defn. of fmap
			      = toAlgebra $ join [] -- By Defn. of join

-- Inductive Case
-- Inductive Hypothesis: 'toAlgebra $ fmap toAlgebra mss = toAlgebra $ join mss'
eval/join/cons:
toAlgebra $ fmap toAlgebra (ms : mss) = toAlgebra $ (toAlgebra ms) : fmap toAlgebra mss        -- By Defn. of fmap
				    = foldr (&lt;&gt;) mempty $ (toAlgebra ms) : fmap toAlgebra mss  -- By Defn. of toAlgebra
				    = toAlgebra ms &lt;&gt; (foldr (&lt;&gt;) mempty $ fmap toAlgebra mss) -- By Defn. of foldr
				    = toAlgebra ms &lt;&gt; toAlgebra (join mss)                     -- Inductive Hypothesis
				    = (foldr (&lt;&gt;) mempty ms) &lt;&gt; (foldr (&lt;&gt;) mempty $ join mss) -- By Defn. of toAlgebra
				    = foldr (&lt;&gt;) mempty $ (ms ++ join mss)                     -- By Defn. of foldr, monoid assoc, and monoid identity
				    = foldr (&lt;&gt;) mempty $ join (ms : mss)                      -- By Defn. of join
				    = toAlgebra $ join (ms : mss)                              -- By Defn. of toAlgebra
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc54e86e" class="outline-3">
<h3 id="orgc54e86e"><span class="section-number-3">6.2</span> <code>fromAlgebra</code> is a Monoid</h3>
<div class="outline-text-3" id="text-6-2">
<p>
First, left and right identities. The proof of the left identity is
basically the same, so we only provide the right.
</p>
<div class="org-src-container">
<pre class="src src-haskell">monoid/identity/right:
m &lt;&gt; mempty = alg [m, alg []]          -- By Defn. of &lt;&gt; and mempty
	    = alg [alg [m], alg []]    -- By eval/pure
	    = alg $ fmap alg [[m], []] -- By Defn. of fmap
	    = alg $ join [[m], []]     -- By eval/join
	    = alg [m]                  -- By Defn. of join
	    = m                        -- By eval/pure
</pre>
</div>

<p>
Now, associativity:
</p>
<div class="org-src-container">
<pre class="src src-haskell">monoid/assoc:
(x &lt;&gt; y) &lt;&gt; z = alg [alg [x, y], z]         -- By Defn. of &lt;&gt;
	      = alg [alg [x, y], alg [z]]   -- By eval/pure
	      = alg $ fmap alg [[x,y], [z]] -- By Defn. of fmap
	      = alg $ join [[x, y], [z]]    -- By eval/join
	      = alg $ join [[x], [y, z]]    -- By Defn. of join
	      = alg $ fmap alg [[x], [y,z]] -- By eval/join
	      = alg [alg [x], alg [y, z]]   -- By Defn. of fmap
	      = alg [x, alg [y, z]]         -- By eval/pure
	      = x &lt;&gt; (y &lt;&gt; z)               -- By Defn. of &lt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org00d16a3" class="outline-3">
<h3 id="org00d16a3"><span class="section-number-3">6.3</span> <code>toAlgebra . fromAlgebra = id</code> and <code>fromAlgebra . toAlgebra = id</code></h3>
<div class="outline-text-3" id="text-6-3">
<p>
Reed is lazy and hasn't wrote these yet! For now, they are an
exercise for the reader.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-04-17 Sat 00:00</p>
<p class="author">Author: Reed Mullanix</p>
<p class="date">Created: 2021-04-17 Sat 11:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
